<?php
$japan_regions = array(
    1 => array("name" => "関東", "prefectures" => array(13 => "東京都", 14 => "神奈川県", 11 => "埼玉県", 12 => "千葉県", 8 => "茨城県", 9 => "栃木県", 10 => "群馬県")),
    2 => array("name" => "関西", "prefectures" => array(27 => "大阪府", 28 => "兵庫県", 26 => "京都府", 29 => "奈良県", 25 => "滋賀県", 30 => "和歌山県")),
    3 => array("name" => "北海道・東北", "prefectures" => array(1 => "北海道", 2 => "青森県", 3 => "岩手県", 4 => "宮城県", 5 => "秋田県", 6 => "山形県", 7 => "福島県")),
    4 => array("name" => "甲信越・北陸", "prefectures" => array(19 => "山梨県", 20 => "長野県", 15 => "新潟県", 16 => "富山県", 17 => "石川県", 18 => "福井県")),
    5 => array("name" => "東海", "prefectures" => array(23 => "愛知県", 22 => "静岡県", 21 => "岐阜県", 24 => "三重県")),
    6 => array("name" => "中国・四国", "prefectures" => array(33 => "岡山県", 34 => "広島県", 31 => "鳥取県", 32 => "島根県", 35 => "山口県", 37 => "香川県", 36 => "徳島県", 38 => "愛媛県", 39 => "高知県")),
    7 => array("name" => "九州・沖縄", "prefectures" => array(40 => "福岡県", 41 => "佐賀県", 44 => "大分県", 43 => "熊本県", 42 => "長崎県", 45 => "宮崎県", 46 => "鹿児島県", 47 => "沖縄県"))
);
?>
